public/man/man1/git-annotate.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - git-annotate.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - git-annotate.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>git-annotate - Annotate file lines with commit information</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<pre class="example">
git annotate [&lt;options&gt;] [&lt;rev-opts&gt;] [&lt;rev&gt;] [--] &lt;file&gt;
</pre>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Annotates each line in the given file with information from the commit
which introduced the line. Optionally annotates from a given revision.</p>
<p>
The only difference between this command and *git-blame*(1) is that they
use slightly different output formats, and this command exists only for
backward compatibility to support existing scripts, and provide a more
familiar command name for people coming from other SCM systems.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>-b</p>
<blockquote>
<p>Show blank SHA-1 for boundary commits. This can also be controlled via
the <strong>blame.blankBoundary</strong> config option.</p>
</blockquote>
<p>
–root</p>
<blockquote>
<p>Do not treat root commits as boundaries. This can also be controlled via
the <strong>blame.showRoot</strong> config option.</p>
</blockquote>
<p>
–show-stats</p>
<blockquote>
<p>Include additional statistics at the end of blame output.</p>
</blockquote>
<p>
-L &lt;start&gt;,&lt;end&gt;, -L :&lt;funcname&gt;</p>
<blockquote>
<p>Annotate only the line range given by <em>&lt;start&gt;,&lt;end&gt;</em>, or by the
function name regex <em>&lt;funcname&gt;</em>. May be specified multiple times.
Overlapping ranges are allowed.</p>
<p>
<em>&lt;start&gt;</em> and <em>&lt;end&gt;</em> are optional. <strong>-L &lt;start&gt;</strong> or <strong>-L &lt;start&gt;,</strong> spans
from <em>&lt;start&gt;</em> to end of file. <strong>-L ,&lt;end&gt;</strong> spans from start of file to
<em>&lt;end&gt;</em>.</p>
<p>
<em>&lt;start&gt;</em> and <em>&lt;end&gt;</em> can take one of these forms:</p>
<blockquote>
<p>·</p>
<p>
number</p>
<p>
If <em>&lt;start&gt;</em> or <em>&lt;end&gt;</em> is a number, it specifies an absolute line
number (lines count from 1).</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
<strong><em>regex</em></strong></p>
<p>
This form will use the first line matching the given POSIX regex. If
<em>&lt;start&gt;</em> is a regex, it will search from the end of the previous <strong>-L</strong>
range, if any, otherwise from the start of file. If <em>&lt;start&gt;</em> is
<strong>^/regex/</strong>, it will search from the start of file. If <em>&lt;end&gt;</em> is a
regex, it will search starting at the line given by <em>&lt;start&gt;</em>.</p>
</blockquote>
<blockquote>
<p>·</p>
<p>
+offset or -offset</p>
<p>
This is only valid for <em>&lt;end&gt;</em> and will specify a number of lines before
or after the line given by <em>&lt;start&gt;</em>.</p>
</blockquote>
<p>
If <strong>:&lt;funcname&gt;</strong> is given in place of <em>&lt;start&gt;</em> and <em>&lt;end&gt;</em>, it is a
regular expression that denotes the range from the first funcname line
that matches <em>&lt;funcname&gt;</em>, up to the next funcname line. <strong>:&lt;funcname&gt;</strong>
searches from the end of the previous <strong>-L</strong> range, if any, otherwise from
the start of file. <strong>^:&lt;funcname&gt;</strong> searches from the start of file. The
function names are determined in the same way as <strong>git diff</strong> works out
patch hunk headers (see <em>Defining a custom hunk-header</em> in
*gitattributes*(5)).</p>
</blockquote>
<p>
-l</p>
<blockquote>
<p>Show long rev (Default: off).</p>
</blockquote>
<p>
-t</p>
<blockquote>
<p>Show raw timestamp (Default: off).</p>
</blockquote>
<p>
-S &lt;revs-file&gt;</p>
<blockquote>
<p>Use revisions from revs-file instead of calling *git-rev-list*(1).</p>
</blockquote>
<p>
–reverse &lt;rev&gt;..&lt;rev&gt;</p>
<blockquote>
<p>Walk history forward instead of backward. Instead of showing the
revision in which a line appeared, this shows the last revision in which
a line has existed. This requires a range of revision like START..END
where the path to blame exists in START. <strong>git blame –reverse START</strong> is
taken as <strong>git blame –reverse START..HEAD</strong> for convenience.</p>
</blockquote>
<p>
–first-parent</p>
<blockquote>
<p>Follow only the first parent commit upon seeing a merge commit. This
option can be used to determine when a line was introduced to a
particular integration branch, rather than when it was introduced to the
history overall.</p>
</blockquote>
<p>
-p, –porcelain</p>
<blockquote>
<p>Show in a format designed for machine consumption.</p>
</blockquote>
<p>
–line-porcelain</p>
<blockquote>
<p>Show the porcelain format, but output commit information for each line,
not just the first time a commit is referenced. Implies –porcelain.</p>
</blockquote>
<p>
–incremental</p>
<blockquote>
<p>Show the result incrementally in a format designed for machine
consumption.</p>
</blockquote>
<p>
–encoding=&lt;encoding&gt;</p>
<blockquote>
<p>Specifies the encoding used to output author names and commit summaries.
Setting it to <strong>none</strong> makes blame output unconverted data. For more
information see the discussion about encoding in the *git-log*(1) manual
page.</p>
</blockquote>
<p>
–contents &lt;file&gt;</p>
<blockquote>
<p>Annotate using the contents from the named file, starting from &lt;rev&gt; if
it is specified, and HEAD otherwise. You may specify <em>-</em> to make the
command read from the standard input for the file contents.</p>
</blockquote>
<p>
–date &lt;format&gt;</p>
<blockquote>
<p>Specifies the format used to output dates. If –date is not provided,
the value of the blame.date config variable is used. If the blame.date
config variable is also not set, the iso format is used. For supported
values, see the discussion of the –date option at *git-log*(1).</p>
</blockquote>
<p>
–[no-]progress</p>
<blockquote>
<p>Progress status is reported on the standard error stream by default when
it is attached to a terminal. This flag enables progress reporting even
if not attached to a terminal. Can&#39;t use <strong>–progress</strong> together with
<strong>–porcelain</strong> or <strong>–incremental</strong>.</p>
</blockquote>
<p>
-M[&lt;num&gt;]</p>
<blockquote>
<p>Detect moved or copied lines within a file. When a commit moves or
copies a block of lines (e.g. the original file has A and then B, and
the commit changes it to B and then A), the traditional <em>blame</em>
algorithm notices only half of the movement and typically blames the
lines that were moved up (i.e. B) to the parent and assigns blame to the
lines that were moved down (i.e. A) to the child commit. With this
option, both groups of lines are blamed on the parent by running extra
passes of inspection.</p>
<p>
&lt;num&gt; is optional but it is the lower bound on the number of
alphanumeric characters that Git must detect as moving/copying within a
file for it to associate those lines with the parent commit. The default
value is 20.</p>
</blockquote>
<p>
-C[&lt;num&gt;]</p>
<blockquote>
<p>In addition to <strong>-M</strong>, detect lines moved or copied from other files that
were modified in the same commit. This is useful when you reorganize
your program and move code around across files. When this option is
given twice, the command additionally looks for copies from other files
in the commit that creates the file. When this option is given three
times, the command additionally looks for copies from other files in any
commit.</p>
<p>
&lt;num&gt; is optional but it is the lower bound on the number of
alphanumeric characters that Git must detect as moving/copying between
files for it to associate those lines with the parent commit. And the
default value is 40. If there are more than one <strong>-C</strong> options given, the
&lt;num&gt; argument of the last <strong>-C</strong> will take effect.</p>
</blockquote>
<p>
–ignore-rev &lt;rev&gt;</p>
<blockquote>
<p>Ignore changes made by the revision when assigning blame, as if the
change never happened. Lines that were changed or added by an ignored
commit will be blamed on the previous commit that changed that line or
nearby lines. This option may be specified multiple times to ignore more
than one revision. If the <strong>blame.markIgnoredLines</strong> config option is set,
then lines that were changed by an ignored commit and attributed to
another commit will be marked with a <strong>?</strong> in the blame output. If the
<strong>blame.markUnblamableLines</strong> config option is set, then those lines
touched by an ignored commit that we could not attribute to another
revision are marked with a <em>*</em>.</p>
</blockquote>
<p>
–ignore-revs-file &lt;file&gt;</p>
<blockquote>
<p>Ignore revisions listed in <strong>file</strong>, which must be in the same format as
an <strong>fsck.skipList</strong>. This option may be repeated, and these files will be
processed after any files specified with the <strong>blame.ignoreRevsFile</strong>
config option. An empty file name, <strong>&#34;&#34;</strong>, will clear the list of revs
from previously processed files.</p>
</blockquote>
<p>
–color-lines</p>
<blockquote>
<p>Color line annotations in the default format differently if they come
from the same commit as the preceding line. This makes it easier to
distinguish code blocks introduced by different commits. The color
defaults to cyan and can be adjusted using the
<strong>color.blame.repeatedLines</strong> config option.</p>
</blockquote>
<p>
–color-by-age</p>
<blockquote>
<p>Color line annotations depending on the age of the line in the default
format. The <strong>color.blame.highlightRecent</strong> config option controls what
color is used for each range of age.</p>
</blockquote>
<p>
-h</p>
<blockquote>
<p>Show help message.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
SEE ALSO
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>*git-blame*(1)</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
GIT
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>Part of the *git*(1) suite</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
